Tekla Open API Reference for Tekla Structures 2025
Events.LayoutEditingModeEntered Event
 The LayoutEditingModeEntered event is raised when layout editing mode is started.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.LayoutEditingModeEnteredDelegate LayoutEditingModeEntered
Public Event LayoutEditingModeEntered As Events.LayoutEditingModeEnteredDelegate
Value
Type: Tekla.Structures.Drawing.UI.Events.LayoutEditingModeEnteredDelegate
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace